
//#Область ОбработчикиСобытийЭлементовШапкиФормы
//// Код процедур и функций
//#КонецОбласти
//
//#Область ОбработчикиСобытийЭлементовТаблицыФормыДвиженияДанныеПоМатериалу
//// Код процедур и функций
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ЗаполнитьАналитику(Темы.ВыгрузитьЗначения(), Теги.ВыгрузитьЗначения());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Вложить(Команда)

	ДанныеСтроки = Элементы.ДвиженияДанныеПоМатериалу.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;

	Если ЗначениеЗаполнено(ДанныеСтроки.Вложение) Тогда
		ПараметрыФормы.Вставить("Ключ", ДанныеСтроки.Вложение)
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Файл");
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораВложения", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Файлы.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораВложения(Вложение, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ДополнительныеПараметры.Файл) Тогда
		ДанныеСтроки = Элементы.ДвиженияДанныеПоМатериалу.ТекущиеДанные;
		ДанныеСтроки.Вложение = Вложение;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
