
//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьФормуПриСоздании(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Файл = Объект.Ссылка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособХраненияПриИзменении(Элемент)
	НастроитьПоРеквизиту_СпособХранения(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиКомандФормы
//// Код процедур и функций
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Диалог

#Область НастройкиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФормуПриСоздании(Форма)
	НастроитьПоРеквизиту_СпособХранения(Форма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПоРеквизиту_СпособХранения(Форма)
    Форма.Элементы.ОтносительныйПуть.Видимость = Форма.Объект.СпособХранения = ПредопределенноеЗначение("Перечисление.СпособыХранения.Путь");
КонецПроцедуры

#КонецОбласти

//#Область ОткрытиеФорм
//#КонецОбласти

//#Область ОбработчикиОповещений
//#КонецОбласти

#КонецОбласти

//#Область ВызовСервера
//#КонецОбласти

#КонецОбласти